<img src = "images/3_logos.png" width = 600, align = "center">
<br>
<h1 align=center><font size = 5>Occupation</font></h1>

### 1. Importer les librairies nécessaires

In [5]:
import pandas as pd
users = pd.read_table ("data_occupation/occupation.user", sep='|')
users.head (5)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

###  2. Importer les données depuis cette [addresse](https://needemand.com/keepsmiling2/index.php/s/P9T5faCH7CFQnez).

### 3. Créer une variable users contenant les données et utiliser 'user_id' comme index

In [ ]:
import pandas as pd
users = pd.read_table ("data_occupation/occupation.user")

### 4. Afficher les 25 premières données.

In [4]:
users.head (25)

   user_id|age|gender|occupation|zip_code
0                 1|24|M|technician|85711
1                      2|53|F|other|94043
2                     3|23|M|writer|32067
3                 4|24|M|technician|43537
4                      5|33|F|other|15213
5                  6|42|M|executive|98101
6              7|57|M|administrator|91344
7              8|36|M|administrator|05201
8                    9|29|M|student|01002
9                    10|53|M|lawyer|90703
10                    11|39|F|other|30329
11                    12|28|F|other|06405
12                 13|47|M|educator|29206
13                14|45|M|scientist|55106
14                 15|49|F|educator|97301
15            16|21|M|entertainment|10309
16               17|30|M|programmer|06355
17                    18|35|F|other|37212
18                19|40|M|librarian|02138
19                20|42|F|homemaker|95660
20                   21|26|M|writer|30068
21                   22|25|M|writer|40206
22                   23|30|F|artist|48197
23                   24|21|F|artist|94533
24                 25|39|M|engineer|55107

### 5. Afficher les 10 dernières

In [8]:
users.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

### 6. Combien y a t-il d'observations dans le jeu de données ?

In [9]:
users.shape

(943, 5)

### 7. Combien y a t-il de colonnes ?

In [10]:
users.shape

(943, 5)

### 8. Afficher les noms de colonnes

In [11]:
users.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

### 9. Quel est le type de données de chaque colonne?

In [15]:
users.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### 10. Afficher la colonne occupation?

In [16]:
users.occupation

0         technician
1              other
2             writer
3         technician
4              other
5          executive
6      administrator
7      administrator
8            student
9             lawyer
10             other
11             other
12          educator
13         scientist
14          educator
15     entertainment
16        programmer
17             other
18         librarian
19         homemaker
20            writer
21            writer
22            artist
23            artist
24          engineer
25          engineer
26         librarian
27            writer
28        programmer
29           student
           ...
913            other
914    entertainment
915         engineer
916          student
917        scientist
918            other
919           artist
920          student
921    administrator
922          student
923            other
924         salesman
925    entertainment
926       programmer
927          student
928        scientist
929        scientist
930         educator
931         educator
932          student
933         engineer
934           doctor
935            other
936         educator
937       technician
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

### 11. Combien y a t-il d'occupations différentes

In [19]:
users.occupation.nunique(dropna=True)

21

### 12. Quelle est la valeur la plus fréquente de la colonne occupation?

In [28]:
vmax = users.groupby("occupation")
tmp = vmax.sum()
tmp.sort_values(by=["occupation"], ascending=False)[['occupation']].head(1)

KeyError: "['occupation'] not in index"

### 13. Faire un résumé statistique du dataFrame ?

In [8]:
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

### 14. Faire un résumé statistique de toutes les colonnes

In [11]:
users.iloc[:,:].describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

### 15. Décrire uniquement la colonne occupation

In [7]:
users["occupation"].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### 17. Quel est l'age moyen des utilisateurs ?

In [6]:
users["age"].mean()

34.05196182396607

### 18 Quel est l'âge le moins fréquent ?

In [20]:
x = users.groupby(['age'])['user_id'].count()
x

age
7      1
10     1
11     1
13     5
14     3
15     6
16     5
17    14
18    18
19    23
20    32
21    27
22    37
23    28
24    33
25    38
26    34
27    35
28    36
29    32
30    39
31    25
32    28
33    26
34    17
35    27
36    21
37    19
38    17
39    22
      ..
41    10
42    21
43    13
44    23
45    15
46    12
47    14
48    20
49    19
50    20
51    20
52     6
53    12
54     4
55    11
56     6
57     9
58     3
59     3
60     9
61     3
62     2
63     3
64     2
65     3
66     1
68     2
69     2
70     3
73     1
Name: user_id, Length: 61, dtype: int64

<hr>
Copyright &copy; 2018 Hatem & Driss @NEEDEMAND